Repository: CompartIT/MES-WebAdmin-Alpha
Catalog: WebAdmin/APP_GlobalResources/Resource.*.resx
Languages: ms, zh_cn

# Txt_RejectingSendingEmail
source: Please wait while rejecting and sending email
ms: Sila tunggu sebentar semasa menolak dan menghantar emel
zh_cn: 正在拒绝并发送邮件，请稍候

# Txt_RejectReason
source: Please fill in the reason for rejection
ms: Sila isi sebab untuk penolakan
zh_cn: 请填写拒绝原因

# Txt_RelatedDeptApprover
source: Related Dept. Approver
ms: Kelulusan Jabatan Berkaitan
zh_cn: 相关部门审核人

# Txt_Remarks
source: Remarks
ms: Comment
zh_cn: 备注

# Txt_RemoveAll
source: Remove All
ms: Keluarkan Semua
zh_cn: 全部移除

# Txt_RemoveSingle
source: Remove Single
ms: Buang Satu
zh_cn: 单个移除

# Txt_Rename
source: Rename
ms: Nama Semula
zh_cn: 更名

# Txt_Reported
source: Reported Qty
ms: Kuantiti Dilaporkan
zh_cn: 已汇报数量

# Txt_ReserveOneOP
source: At least one process shall be reserved
ms: Sekurang-kurangnya satu proses hendaklah dikhaskan
zh_cn: 至少保留一道工序

# Txt_Reset
source: Reset
ms: Set semula
zh_cn: 重置

# Txt_ResetConfirm
source: Reset password confirmation
ms: Pengesahan set semula kata laluan
zh_cn: 重置密码确认

# Txt_ResetPassToLogin1
source: Your password has been reset. Please
ms: Kata laluan anda telah diset semula. Sila
zh_cn: 您的密码已重置。请

# Txt_ResetPassword
source: Reset password
ms: Set semula kata laluan
zh_cn: 重置密码

# Txt_ResetPassword2
source: Reset your password.
ms: Set semula kata laluan anda.
zh_cn: 重置您的密码.

# Txt_ResponsePlan
source: Response Plan
ms: Pelan Tindak Balas
zh_cn: 反应计划

# Txt_Return
source: Return
ms: Kembali
zh_cn: 返回

# Txt_Revision
source: Revision
ms: Semakan
zh_cn: 版本

# Txt_RevisionDetails
source: Revision Details
ms: Butiran Revisi
zh_cn: 版本详情

# Txt_RevisionList
source: Revision List
ms: Senarai Revisi
zh_cn: 版本列表

# Txt_RevisionNoEmpty
source: The revision No. is empty, or the length is more than 50
ms: No. revisi kosong, atau panjangnya lebih daripada 50
zh_cn: 版本号为空，或长度超过50

# Txt_ReworkOP
source: Rework OP
ms: Kerja semula OP
zh_cn: 返工工序

# Txt_ReworkOPSelect
source: Select Rework OP
ms: Pilih Kerja semula OP
zh_cn: 返工工序选择

# Txt_ReworkQuantity
source: Rework Quantity
ms: Kuantiti Kerja Semula
zh_cn: 返工数量

# Txt_ReworkQuantityNoEmpty
source: Rework quantity cannot be empty
ms: Kuantiti kerja semula tidak boleh kosong
zh_cn: 返工数量不能为空

# Txt_ReworkQuantityPositive
source: Rework quantity must be a positive integer
ms: Kuantiti kerja semula mestilah nombor positif
zh_cn: 返工数量必须为正整数

# Txt_ReworkScrapEqualMRB
source: The sum of rework and scrap quantity must be equal to the MRB quantity
ms: Jumlah kerja semula dan kuantiti dibuang mestilah sama dengan kuantiti MRB
zh_cn: 返工与报废数量之和必须等于不合格数量

# Txt_Save
source: Save
ms: Simpan
zh_cn: 保存

# Txt_ScanMRBThenRework
source: Scan the MRB jobnum list for processing, and then rework
ms: Imbas senarai Nombor job MRB untuk diproses, dan kemudian kerja semula
zh_cn: 扫描MRB不合格品单处理后,再进行返工处理

# Txt_ScrapQuantity
source: Scrap Quantity
ms: Kuantiti Dibuang
zh_cn: 报废数量

# Txt_ScrapQuantityNoEmpty
source: Scrap quantity cannot be empty
ms: Kuantiti dibuang tidak boleh kosong
zh_cn: 报废数量不能为空

# Txt_ScrapQuantityPositive
source: Scrap quantity must be a positive integer
ms: Kuantiti dibuang mestilah nombor positif
zh_cn: 报废数量必须为正整数

# Txt_Search
source: Search
ms: Carian
zh_cn: 搜索

# Txt_SelectAll
source: Select All
ms: Pilih Semua
zh_cn: 全选

# Txt_Send
source: Send
ms: Hantar
zh_cn: 发送

# Txt_SendAuth
source: Select Two-Factor Authentication Provider:
ms: Pilih Pembekal Dua Faktor Pengesahan:
zh_cn: 选择双因素身份验证提供程序：

# Txt_SendCode
source: Send verification code
ms: Hantar kod verifikasi
zh_cn: 发送验证码

# Txt_SendingEmailToQM
source: Please wait for a moment while sending mail to QM
ms: Sila tunggu seketika semasa menghantar emel ke QM
zh_cn: 正在发送邮件给品质，请稍候

# Txt_SentEmail
source: System has sent email successfully
ms: Sistem telah berjaya menghantar e-mel
zh_cn: 已发送邮件

# Txt_ShowAll
source: Show All
ms: Papar Semua
zh_cn: 全部显示

# Txt_SizeOutofTolerance
source: Size out of tolerance details
ms: Saiz di luar butiran toleransi
zh_cn: 尺寸超差明细

# Txt_Split
source: Split
ms: Bahagi
zh_cn: 拆分

# Txt_SplitEpicorJobnumConfirm
source: Are you sure to split the selected Epicor Jobnum
ms: Adakah anda pasti hendak membahagikan Nombor job Epicor yang dipilih?
zh_cn: 确定拆分所选的Epicor工单吗

# Txt_SplitJobnumFailed
source: Failed to split jobnum
ms: Gagal membahagi Nombor job
zh_cn: 工单拆分失败

# Txt_SplitJobnumSucceeded
source: Succeeded to split jobnum
ms: Berjaya membahagi Nombor job
zh_cn: 工单拆分已成功

# Txt_SplitQuantity
source: Split Quantity
ms: Kuantiti yang telah Dibahagikan
zh_cn: 拆分数量

# Txt_Splitted
source: Splitted
ms: Berpecah
zh_cn: 已拆分

# Txt_Status
source: Status
zh_cn: 状态

# Txt_CreateReworkJobnumConfirm
source: Confirm to create a rework jobnum
ms: Sahkan untuk mencipta Nombor job kerja semula?
zh_cn: 确定创建返工工单?

# Txt_Success
source: Success
ms: Sukses
zh_cn: 成功

# Txt_Warining
source: Warining
ms: Amaran
zh_cn: 警告

# Txt_UserManagement
source: User right management
ms: Pengurusan hak pengguna
zh_cn: 用户权限管理

# Txt_RightList
source: Right list
ms: Senarai hak pengurusan
zh_cn: 权限列表

# Txt_Name
source: Name
ms: Nama
zh_cn: 名称

# Txt_Parameter
source: Parameter
zh_cn: 参数

# Txt_Order
source: Order
zh_cn: 排序

# Txt_RightDetails
source: Right Details
ms: Maklumat Hak Pengurusan
zh_cn: 权限详情

# Txt_OPGroup
source: OP Group
ms: Kumpulan OP
zh_cn: 工序组

# Txt_DisplayName
source: Display name
ms: Nama Paparan
zh_cn: 显示名

# Txt_RightGroup
source: Right Group
ms: Hak Pengurusan Kumpulan
zh_cn: 权限组

# Txt_UserDetails
source: User Details
ms: Maklumat Pengguna
zh_cn: 用户详情

# Txt_Password
source: Password
ms: Kata Laluan
zh_cn: 密码

# Txt_UserType
source: User Type
ms: Jenis Pengguna
zh_cn: 用户类型

# Txt_Valid
source: Valid
ms: Sah
zh_cn: 有效

# Txt_Administrator
source: Administrator
ms: Pentadbir
zh_cn: 管理员

# Txt_OrdinaryUser
source: Ordinary User
ms: Pengguna Biasa
zh_cn: 普通用户

# Txt_VMIQualityInspection
source: VMI Quality Inspection
ms: Pemeriksaan Kualiti VMI
zh_cn: VMI质检

# Txt_MateralHandle
source: MateralHandle
zh_cn: 物流组

# Txt_ViewLotTraveller
source: View Lot Traveller
ms: Lihat Lot Traveller
zh_cn: 查看流程表

# Txt_SpecialOP
source: Special OP
ms: OP Istimewa
zh_cn: 特殊工序

# Txt_UserRight
source: User Right
ms: Hak Pengurusan Pengguna
zh_cn: 用户权限

# Txt_OneUserSelect
source: Please select at least one user
ms: Sila pilih sekurang-kurangnya satu pengguna
zh_cn: 请选择至少一个用户

# Txt_ErrorOccur
source: Error
ms: Ralat
zh_cn: 出错了

# Txt_UpdateRightConfirm
source: Are you sure to update user right?
ms: Adakah anda pasti untuk mengemas kini hak pengurusan pengguna?
zh_cn: 确定更新用户权限吗？

# Txt_NoRightAPPUser
source: Cannot set web platform right for APP user
ms: Tidak boleh menetapkan platform web yang betul untuk pengguna APP
zh_cn: APP用户不能设置Web平台权限

# Txt_UsernameNotEmpty
source: Username can not be empty
ms: Nama pengguna tidak boleh kosong
zh_cn: 用户名不能为空

# Txt_UsernameTooLong
source: Username is too long
ms: Nama pengguna terlalu panjang
zh_cn: 用户名长度过长

# Txt_UserExists
source: User already exists
ms: Pengguna sudah wujud
zh_cn: 用户已存在

# Txt_MainMenu
source: Main Menu
ms: Menu Utama
zh_cn: 主菜单

# Txt_Submit
source: Submit
ms: Hantar
zh_cn: 提交

# Txt_SubmitApproval
source: Submit for approval
ms: Hantar untuk kelulusan
zh_cn: 提交审核

# Txt_SubmitApprovalSucceeded
source: Succeeded to submitt approval
ms: Berjaya menghantar kelulusan
zh_cn: 提交审核成功

# Txt_SubmitComplete
source: Submit to Complete
ms: Hantar untuk Selesai
zh_cn: 提交完成

# Txt_SubmitFailed
source: Failed to submit
ms: Hantar gagal
zh_cn: 提交失败

# Txt_SubmitManager
source: Submit to Manager
ms: Hantar kepada Pengurus
zh_cn: 提交经理

# Txt_SubmitQMSucceeded
source: Submitted to QM successfully
ms: Dihantar kepada QM dengan jayanya
zh_cn: 提交品质成功

# Txt_SubmittingApproval
source: Please wait for a moment while submitting approval and sending mail
ms: Sila tunggu seketika semasa menghantar kelulusan dan menghantar emel
zh_cn: 正在提交审核并发送邮件，请稍候

# Txt_SubmitToQM
source: Submit to QM
ms: Hantar kepada Kualiti
zh_cn: 提交品质

# Txt_Supplier
source: Supplier/Plant
ms: Pembekal/Loji
zh_cn: 供应商/厂商

# Txt_SupplierApproval
source: Supplier/Plant Approval/Date
ms: Pembekal/Kelulusan Loji/Tarikh
zh_cn: 供应商/厂商认可/日期

# Txt_SupplierCode
source: Supplier Code
ms: Kod Pembekal
zh_cn: 供应商代码

# Txt_SwitchViews
source: Switch Views
ms: Tukar paparan
zh_cn: 切换视图

# Txt_Synchronize
source: Synchronize
ms: Segerakkan
zh_cn: 同步

# Txt_SynchronizeConfirm1
source: The synchronization takes a long time. Do not close the page
ms: Penyegerakan mengambil masa yang lama. Jangan tutup halaman
zh_cn: 同步时间较长,请勿关闭页面

# Txt_SynchronizeFailed
source: Failed to Synchronize
ms: Gagal Menyegerakkan
zh_cn: 同步失败

# Txt_SynchronizeSucceeded
source: Succeeded to Synchronize
ms: Berjaya Menyegerakkan
zh_cn: 同步成功

# Txt_Synchronizing
source: Synchronizing (do not close the page), please wait
ms: Sedang menyegerakkan (jangan tutup halaman), sila tunggu
zh_cn: 同步中(切勿关闭页面)，请稍候

# Txt_TempFile
source: Temp File
ms: Fail Sementara
zh_cn: 临时文件

# Txt_TestFrequency
source: TestFrequency
ms: Kekerapan Ujian
zh_cn: 抽样频率

# Txt_TestInstrument
source: TestInstrument
ms: Instrumen Ujian
zh_cn: 检测仪器

# Txt_Title
source: Title
ms: Tajuk
zh_cn: 题目

# Txt_TitleNoEmpty
source: Title cannot be empty
ms: Tajuk tidak boleh kosong
zh_cn: 题目不能为空

# Txt_Tolerance
source: Tolerance
ms: Toleransi
zh_cn: 控制公差

# Txt_UserList
source: User List
ms: Senarai Pengguna
zh_cn: 用户列表

# Txt_Type
source: Type
ms: Jenis
zh_cn: 类型

# Txt_Unapproved
source: Unapproved
ms: Tidak lulus
zh_cn: 未审核

# Txt_Unconfirmed
source: Unconfirmed
ms: Tidak Disahkan
zh_cn: 未确认

# Txt_Unhandled
source: Unhandled
ms: Tidak Dikendalikan
zh_cn: 未处理

# Txt_Unmark
source: Unmark
ms: Nyahtanda
zh_cn: 取消标记

# Txt_Unsplit
source: Unsplit
ms: Satukan semula
zh_cn: 未拆分

# Txt_UpdateFailed
source: Update failed
ms: Kemaskini gagal
zh_cn: 更新失败

# Txt_UploadCAD
source: Upload CAD
ms: Muat naik CAD
zh_cn: 上传CAD

# Txt_UploadCustomerDrawing
source: Upload customer drawing
ms: Muat naik lukisan pelanggan
zh_cn: 上传客户图纸

# Txt_UploadExceedMax
source: The number of files selected to upload ({n}) exceeds the maximum allowed value {m}
ms: Bilangan fail yang dipilih untuk dimuat naik ({n}) melebihi nilai maksimum yang dibenarkan {m}
zh_cn: 选择上传的文件数量({n}) 超过允许的最大数值{m}

# Txt_UploadFailed
source: Upload failed
ms: Muat naik gagal
zh_cn: 上传失败

# Txt_UploadFile
source: Upload File
ms: Muat naik Fail
zh_cn: 上传文件

# Txt_UploadHeatcode
source: Please upload heatcode
ms: Sila muat naik kod heat
zh_cn: 请上传heatcode

# Txt_Uploading
source: Uploading file, wait for a moment please
ms: Sedang memuat naik fail, sila tunggu sebentar
zh_cn: 正在上传文件，请稍候

# Txt_UploadSucceeded
source: Succeeded to upload
ms: Muat naik berjaya
zh_cn: 上传成功

# Txt_Username
source: Username
ms: Nama Pengguna
zh_cn: 用户帐号

# Txt_UsernamePasswordError
source: Username or password error
ms: Nama pengguna atau ralat kata laluan
zh_cn: 用户名或密码错误

# Txt_UsernamePasswordNoEmpty
source: Username or password cannot be empty
ms: Nama pengguna atau kata laluan tidak boleh kosong
zh_cn: 用户名或密码不能为空

# Txt_Vendor
source: Vendor
ms: Penjual
zh_cn: 供应商

# Txt_Verify
source: Verify
ms: Sahkan
zh_cn: 验证

# Txt_View
source: View
ms: Paparan
zh_cn: 查看

# Txt_WelcomeUseMES
source: Welcome to the Compart MES Web Platform
ms: Selamat datang ke laman MES Compart
zh_cn: 欢迎使用Compart MES Web平台

# Txt_WINo
source: WI Number
ms: Nombor WI
zh_cn: WI编号

# Menu_WebAssemblyJobList
source: Web Assembly Job List
ms: Senarai Job Pemasangan Web
zh_cn: Web 组装工单列表

# Menu_WebJobList
source: Web Job List
ms: Senarai Job Web
zh_cn: Web 工单列表

# Menu_WebJobSplit
source: Web Job Split
ms: Bahagi Job Web
zh_cn: Web 工单拆分

# Txt_AccountLockout
source: This account has been locked out, please try again later
ms: Akaun ini telah dikunci, sila cuba sebentar lagi
zh_cn: 该帐户已被锁定，请稍后再试

# Txt_ConfirmedNoReconfirm
source: Confirmed, no need to confirm again
ms: Telah disahkan, tidak perlu sahkan sekali lagi
zh_cn: 已确认，无需重复确认

# Txt_EqualReceivedQuantity
source: The sum of qualified, reworked, split and scrapped quantities must be equal to the received quantity
ms: Jumlah kuantiti yang layak, kerja semula, yang telah dibahagikan, dan dibuang mestilah sama dengan kuantiti yang diterima
zh_cn: 合格、返工、拆分、报废数量之和必须等于收货数量

# Txt_InternalReworkNotEmpty
source: Internal Rework quantity cannot be empty
ms: Kuantiti Kerja Semula Dalaman tidak boleh kosong
zh_cn: 内部返工数量不能为空

# Txt_InternalReworkPositive
source: Internal Rework quantity must be a positive integer
ms: Kuantiti Kerja Semula Dalaman mestilah nombor positif
zh_cn: 内部返工数量必须为正整数

# Txt_InternalReworkQuantity
source: Internal Rework Quantity
ms: Kuantiti Kerja Semula Dalaman
zh_cn: 内部返工数量

# Txt_Invoice
source: PackNum
zh_cn: 发货单

# Txt_Lockout
source: Locked out
ms: Dikunci
zh_cn: 已锁定

# Txt_Logoff
source: Log off
ms: Log keluar
zh_cn: 注销

# Txt_NoSubmitConfirmedOutsourceRecords
source: Confirmed out records cannot be submitted. Please select again
ms: Rekod keluar yang telah disahkan tidak boleh dihantar. Sila pilih sekali lagi
zh_cn: 不能提交已确认的外发记录，请重新选择

# Txt_OutsourcePack
source: Outsource Pack
ms: Pek Sumber Luar
zh_cn: 外包发货

# Txt_OutsourcePackNum
source: Outsource PackNum
ms: PackNum Sumber Luar
zh_cn: 外包发货单

# Txt_OutsourcePackNumSelect
source: Please select the outsource PackNum to be printed
ms: Sila pilih PackNum Sumber Luar untuk dicetak
zh_cn: 请选择需要打印的外包发货单

# Txt_OutsourceQuantityNotEmpty
source: Outsource quantity cannot be empty
ms: Kuantiti Sumber Luar tidak boleh kosong
zh_cn: 外包返工数量不能为空

# Txt_OutsourceQuantityPositive
source: Outsource quantity must be a positive integer
ms: Kuantiti Sumber Luar mestilah nombor positif
zh_cn: 外包返工数量必须为正整数

# Txt_OutsourceReceipt
source: Outsource Receipt
ms: Penerimaan Sumber Luar
zh_cn: 外包收货

# Txt_OutsourceReworkQuantity
source: Outsource Rework Quantity
ms: Kuantiti Kerja Semula Sumber Luar
zh_cn: 外包返工数量

# Txt_PO
source: PO
zh_cn: 采购订单

# Txt_QualifiedQuantity
source: Qualified quantity
ms: Kuantiti yang Layak
zh_cn: 合格数量

# Txt_QualifiedQuantityPositive
source: Qualified quantity must be a positive integer
ms: Kuantiti yang Layak mestilah nombor positif
zh_cn: 合格数量必须为正整数

# Txt_ReceiptQuantity
source: Receipt Quantity
ms: Kuantiti Penerimaan
zh_cn: 接收数量

# Txt_ReceivedQuantity
source: Received Quantity
ms: Kuantiti Penerimaan
zh_cn: 接收数量

# Txt_ReceivedPackNum
source: PackNum
ms: Penerimaan
zh_cn: 收货单

# Txt_RequestError
source: An error occurred while processing your request
ms: Ralat berlaku semasa memproses permintaan anda
zh_cn: 处理请求的时候发生了错误

# Txt_VendorReturns
source: Vendor returns
ms: Pemulangan Vendor
zh_cn: 供应商退回

# Txt_ResetPassToLogin2
source: click here to log in
ms: klik disini untuk log masuk
zh_cn: 点击此处登录

# Txt_AlternateVersion
source: Alternative version
ms: Versi Alternatif
zh_cn: 替代版本

# Txt_DropFileUpload
source: Drop files here or click to upload.
ms: Letakkan fail di sini atau klik untuk memuat naik.
zh_cn: 将文件拖到此处或单击以上传。

# Txt_QMProcessing
source: QM processing
ms: QM sedang memproses
zh_cn: 品质处理中

# Txt_QMSubmitted
source: QM has submitted
ms: Telah dihantar oleh QM
zh_cn: 品质已提交

# Txt_SubmittedToQM
source: Submitted to QM
ms: Dihantar ke QM
zh_cn: 已提交品质

# Txt_ToBeConfirmedByEngineer
source: To be confirmed by Engineer
ms: Untuk disahkan oleh Jurutera
zh_cn: 待工程确认

# Txt_ToBeQMProcessed
source: To be QM processed
ms: Untuk diproses oleh QM
zh_cn: 待品质处理

# Txt_About
source: About
ms: Tentang
zh_cn: 关于

# Txt_AdditionalInfor
source: Use this area to provide additional information
ms: Gunakan kawasan ini untuk memberikan maklumat tambahan
zh_cn: 使用当前区域来提供额外信息

# Txt_Contact
source: Contact
ms: Hubungi
zh_cn: 联系

# Txt_ControlPlanEmpty
source: Control plan number is empty, or the length is more than 50
ms: Nombor pelan kawalan kosong, atau panjangnya lebih daripada 50
zh_cn: 控制计划编号为空，或长度超过50

# Txt_CustomerPartnumEmpty
source: Customer part number is empty, or the length is more than 50
ms: Nombor produk pelanggan kosong, atau panjangnya lebih daripada 50
zh_cn: 客户产品编号为空，或长度超过50

# Txt_HomePage
source: Home Page
ms: Halaman Utama
zh_cn: 主页

# Txt_Normal
source: Normal
zh_cn: 正常

# Txt_PartnumDetails
source: Partnum Details
ms: Maklumat Partnum
zh_cn: 编号详情

# Txt_Modify
source: Modify
ms: Ubah Suai
zh_cn: 修改

# Txt_BatchQuantity
source: Lot Quantity
ms: Kuantiti kumpulan
zh_cn: 批数量

# Txt_UploadHCFirst
source: Please upload the heatcode first
ms: Sila muat naik Heatcode dahulu
zh_cn: 请先上传Heatcode

# Txt_SplitPerQty
source: Split Per Qty
ms: Pembahagian Setiap Kuantiti
zh_cn: 包装量

# Txt_WebJobNum
source: Web JobNum
ms: Nombor job Web
zh_cn: Web工单号

# Txt_CancelSplit
source: Cancel Split
ms: Batal Pembahagian
zh_cn: 取消拆分

# Txt_CannotSplitWebJobnum
source: The web jobnum can not be splitted
ms: Nombor job Web tidak dapat dibahagikan
zh_cn: 该Web工单不能拆分

# Txt_DetermineSplit
source: Determine Split
ms: Tentukan Pembahagian
zh_cn: 确定拆分

# Txt_MustInputValidInter
source: You must enter a valid number
ms: Anda mesti memasukkan nombor yang sah
zh_cn: 必须输入有效的数字

# Txt_SplitWebJobnumConfirm
source: Are you sure to split the selected web Jobnum
ms: Adakah anda pasti ingin membahagikan Nombor job Web yang dipilih?
zh_cn: 确定拆分所选的Web工单吗

# Txt_SubJobNumSplit
source: Sub JobNum Split
ms: Pembahagian tertib subkerja
zh_cn: 子工单拆分

# Txt_Handle
source: Handle
zh_cn: 处理

# Txt_ScrapPartNum
source: Scrap PartNum
ms: PartNum Buangan
zh_cn: 报废产品编号

# Txt_AppUser
source: App User
ms: Pengguna App
zh_cn: App用户

# Txt_DisplayNameNotEmpty
source: DisplayName can not be empty
ms: Nama Paparan tidak boleh kosong
zh_cn: 显示名不能为空

# Txt_DisplayNameTooLong
source: DisplayName is too long
ms: Nama Paparan terlalu panjang
zh_cn: 显示名长度过长

# Txt_EmployeeID
source: EmployeeID
ms: ID Pekerja
zh_cn: 工号

# Txt_PasswordNotEmpty
source: Password can not be empty
ms: Kata Laluan tidak boleh kosong
zh_cn: 密码不能为空

# Txt_PasswordTooLong
source: Password is too long
ms: Kata Laluan terlalu panjang
zh_cn: 密码长度过长

# Txt_Right
source: Access
ms: Jurisdiksi
zh_cn: 权限

# Txt_SearchBy
source: Search By
ms: Carian Oleh
zh_cn: 查询条件

# Txt_WebAppUser
source: Web/App User
ms: Web/Aplikasi Pengguna
zh_cn: Web/App用户

# Txt_WebUser
source: Web User
ms: Pengguna Web
zh_cn: Web用户

# SQL_CopiedRevNoNotExists
source: Copied revision number does not exists
ms: Nombor versi yang disalin tidak wujud!
zh_cn: 复制的版本编号不存在!

# SQL_CurEWINotSubmitToYou
source: Current EWI has not been submitted to you for approval!
ms: EWI semasa tidak dihantar kepada anda untuk persetujuan!
zh_cn: 当前EWI没有提交给您审核!

# SQL_CurRevApprovedCanNotCopy
source: Current version already approved, not allow to replicate version
ms: Versi semasa telah diluluskan, tidak dibenarkan duakan versi!
zh_cn: 当前版本已审核，不允许复制版本!

# SQL_CurRevApprovedCanNotDelete
source: Already approve, not allow to delete!
ms: Telah diluluskan, tidak dibenarkan padam!
zh_cn: 已审核，不允许删除!

# SQL_CurRevApprovedCanNotModify
source: Already approve, not allow to edit!
ms: Telah diluluskan, tidak dibenarkan sunting!
zh_cn: 已审核，不允许修改!

# SQL_CurRevApprovedCanNotModifyStatus
source: Already approved, not allow to modify status!
ms: Semakan telah selesai, pengubahsuaian status tidak dibenarkan!
zh_cn: 已完成审核，不允许修改状态!

# SQL_CurRevApprovedCanNotReApprove
source: Already approve our not submit, no allow to reapprove!
ms: Telah diluluskan atau tidak dihantar, tidak dibenarkan untuk menghantar semula
zh_cn: 已审核或者未提交，不允许重复审核!

# SQL_CurRevApprovedCanNotRepetitiveReject
source: Already approved, not allow to reject repeatedly!
ms: Telah diluluskan, tidak dibenarkan menolak berulang kali
zh_cn: 已审核或者已拒绝，不允许重复拒绝!

# SQL_CurRevApprovedCanNotSubmit
source: Already approved, not allow to resubmit!
ms: Telah diluluskan, tidak dibenarkan menghantar semula
zh_cn: 已完成审核，不能再次提交!

# SQL_DataCanNotEmpty
source: Data cannot be empty!
ms: Data tidak boleh kosong!
zh_cn: 值不能为空!

# SQL_DataError
source: Wrong data, please contact IT!
ms: Data yang salah, sila hubungi IT!
zh_cn: 数据错误，请联系IT!

# SQL_ExistsUnApprovedRev
source: There are un approved revision, please handle it first!
ms: Terdapat versi yang tidak diluluskan, sila kendalikan ianya dulu!
zh_cn: 存在未审核的版本，请先处理该版本!

# SQL_ExistsUnCompletedRevFA
source: There are unfinished FA version, please handle it first!
ms: Terdapat versi FA yang tidak selesai, sila kendalikan ianya dulu!
zh_cn: 存在未完成的FA版本，请先处理该版本!

# SQL_NoECNRelatedApprover
source: Did not set ECN approval personnel, not allow to submit!
ms: Tiada penerima jabatan berkaitan ECN ditetapkan, tidak dapat menghantar!
zh_cn: 没有设置ECN相关部门审核人员，不允许提交!

# SQL_NoSelfCopy
source: Cannot self replicate!
ms: Tidak boleh diduakan dengan sendiri!
zh_cn: 不能自我复制!

# SQL_NotSelectCorrectRow
source: please choose the correct data row!
ms: Sila pilih barisan data yang betul!
zh_cn: 未选择正确的数据行!

# SQL_OPNoBasicCanNotReject
source: there are job that has not set basic data, not allow to reject!
ms: Terdapat job yang tidak di set data asas, tidak dibenarkan menolak!
zh_cn: 有工序未设置基础资料，不允许拒绝!

# SQL_OPNoBasicCanNotSubmit
source: There are job that has not set basic data, not allow to submit!
ms: Terdapat job yang tidak di set data asas, tidak dibenarkan menghantar!
zh_cn: 有工序未设置基础资料，不允许提交!

# SQL_OPNotExists
source: OP does not exists
ms: OP tidak wujud
zh_cn: 工序不存在

# SQL_OverLimit
source: Over the limit!
ms: Melebihi had!
zh_cn: 超过次数限制!

# SQL_ParameterError
source: Parameter entries error!
ms: Ralat entri parameter!
zh_cn: 参数传入错误！

# SQL_TestInstrumentExists
source: Test equipment existed!
ms: Peralatan ujian wujud!
zh_cn: 检测仪器已存在!

# SQL_TestInstrumentNotExists
source: Test equipment not existed!
ms: Peralatan ujian tidak wujud!
zh_cn: 检测仪器不存在!

# SQL_UpdateTestInstrumentCategoryFailed
source: Update test instrucment fail, please check if test instrument exists!
ms: Kemas kini instrumen ujian gagal, sila semak sama ada instrumen ujian wujud!
zh_cn: 更新检测仪器标志失败，请检查仪器是否存在!

# SQL_UpdateTestInstrumentFailed
source: Check on test instrument fail, please check if it exists!
ms: Pemeriksaan ke atas instrumen ujian gagal, sila semak jika ia wujud!
zh_cn: 更新检测仪器失败，请检查仪器是否存在!

# Txt_ApproveEWI
source: has approved a EWI revision
ms: telah menyetujui revisi EWI
zh_cn: 审核了EWI版本

# Txt_ApproveFinishEWI
source: has approved a EWI revision, and the approval is completed
ms: telah menyetujui revisi EWI, dan persetujuan selesai
zh_cn: 审核了EWI版本，审核已完成

# Txt_BatchReceiptFailed
source: Failed to lot receipt
ms: Gagal menerima barang dalam lot
zh_cn: 批量收货失败

# Txt_ClickToView
source: Click to view
ms: Klik untuk melihat
zh_cn: 点击查看

# Txt_ECNUserEmailNotMatched
source: The number of ECN users and email addresses in the setting does not match
ms: Bilangan pengguna ECN dan alamat e-mel dalam tetapan tidak sepadan
zh_cn: 设置表ECN用户和邮件地址数量不匹配

# Txt_EWIParameterMaintained
source: The parameter of EWI revision need to be maintained
ms: Parameter revisi EWI perlu ditetapkan
zh_cn: EWI版本参数待维护

# Txt_EWIRevisionInfor
source: EWI Revision Information
ms: Maklumat Revisi EWI
zh_cn: EWI版本信息

# Txt_FileRename
source: The file has been renamed
ms: Fail telah dinamakan semula
zh_cn: 文件已更名为

# Txt_InvalidCode
source: Invalid code.
ms: Kod tidak sah.
zh_cn: 无效代码。

# Txt_InvalidLoginAttempt
source: Invalid login attempt.
ms: Percubaan log masuk tidak sah.
zh_cn: 登录尝试无效。

# Txt_JobModifyFailed
source: Failed to midify jobnum {0}
ms: Gagal untuk mengubah suai Nombor job {0}
zh_cn: 工单{0}修改失败

# Txt_JobModifySucceeded
source: Succeeded to midify jobnum {0}
ms: Nombor job {0} berjaya diubah suai
zh_cn: 工单{0}修改成功

# Txt_JobStartNoModify
source: Jobnum {0} has started, can't be modified
ms: Nombor job {0} telah dimulakan, tidak boleh diubah suai
zh_cn: 工单{0}已开工，不能修改

# Txt_NoEWIFile
source: EWI file has not been generated
ms: Fail EWI tidak dihasilkan
zh_cn: 还未生成EWI文件

# Txt_NoRevisionAddFirst
source: None revision exists. Please add a new revision, then copy it again
ms: Tiada revisi wujud. Sila tambah revisi baharu, kemudian salin semula
zh_cn: 当前无版本，请新增版本再复制
