Repository: CompartIT/MES-WebAdmin-Alpha
Catalog: WebAdmin/APP_GlobalResources/Resource.*.resx
Languages: ms, zh_cn

# Menu_AppearanceInspect
source: Appearance Inspect
ms: Pemeriksaan Penampilan
zh_cn: 外观抽检

# Menu_AssemblyJobSplit
source: Assembly Job Split
ms: Bahagi Job Pemasangan
zh_cn: 组装工单拆分

# Menu_BasicData
source: Basic Data
ms: Data Asas
zh_cn: 基础数据

# Menu_EpicorJobSplit
source: Epicor Job Split
ms: Bahagi Job Epicor
zh_cn: Epicor工单拆分

# Menu_EWIApprove
source: EWI Approve
ms: EWI yang telah diluluskan
zh_cn: EWI 审核

# Menu_EWIMaintenance
source: EWI Maintenance
ms: Penyelenggaraan EWI
zh_cn: EWI 维护

# Menu_EWIMaintenanceFA
source: EWI Maintenance(FA)
ms: Penyelenggaraan EWI(FA)
zh_cn: EWI 维护(FA)

# Menu_EWIMaintenanceNPI
source: EWI Maintenance(Non-Std)
ms: Penyelenggaraan EWI(Non-Std)
zh_cn: EWI 维护(Non-Std)

# Menu_FirstInspect
source: First Inspect
ms: Pemeriksaan Pertama
zh_cn: 首检报告

# Menu_FirstReport
source: First Report
ms: Laporan Pertama
zh_cn: 首件报告

# Menu_InspectMgmt
source: Inspect Mgmt
ms: Pengurusan Pemeriksaan
zh_cn: 检验管理

# Menu_InspectRecord
source: Inspect Record
ms: Rekod Pemeriksaan
zh_cn: 巡检记录

# Menu_IPQCInspect
source: IPQC Inspect
ms: Pemeriksaan IPQC
zh_cn: IPQC抽检

# Menu_JobMgmt
source: Job Mgmt
ms: Pengurusan Job
zh_cn: 工单管理

# Menu_JobReturn
source: Create Rework Job
ms: Bahagi Job Kerja Semula
zh_cn: 返工工单处理

# Menu_MRBFastProcess
source: MRB Fast Process
ms: Proses Pantas MRB
zh_cn: MRB快速扫描处理

# Menu_MRBMgmt
source: MRB Mgmt
ms: Pengurusan MRB
zh_cn: MRB 管理

# Menu_MRBPrint
source: MRB Print
ms: Cetak MRB
zh_cn: MRB不合格品单打印

# Menu_MRBProcess
source: MRB Process
ms: Proses MRB
zh_cn: MRB处理

# Menu_ProdMgmt
source: Production Mgmt
ms: Pengurusan Pengeluaran
zh_cn: 生产管理

# Menu_QuanlityMgmt
source: QM Mgmt
ms: Pengurusan Kualiti
zh_cn: 质量管理

# Menu_QuanlityNotice
source: Quanlity Notice
ms: Notis Kualiti
zh_cn: 质量问题通知单

# Menu_QuanlityProblem
source: Quanlity Problem
ms: Masalah Kualiti
zh_cn: 质量问题单

# Menu_ReportCentre
source: Report Centre
ms: Pusat Laporan
zh_cn: 报表中心

# Menu_ReworkCentre
source: Rework Centre
ms: Pusat Kerja Semula
zh_cn: 返工中心

# Menu_ReworkJobModify
source: Rework Job Modify
ms: Ubah Suai Job Kerja Semula
zh_cn: 返工工单修改

# Menu_SubcontractMgmt
source: Subcontract Mgmt
ms: Pengurusan Sub Kontrak
zh_cn: 外包管理

# Menu_SubcontractReceipt
source: Subcontract Receipt
ms: Penerimaan
zh_cn: 外包收货

# Menu_SubcontractShipment
source: Subcontract Shipment
ms: Penghantaran
zh_cn: 外包发货

# Menu_SystemMgmt
source: System Mgmt
ms: Pengurusan Sistem
zh_cn: 系统管理

# Menu_UserMgmt
source: User Mgmt
ms: Pengurusan Pengguna
zh_cn: 用户管理

# Txt_ScannedCorrectMRBConfirm
source: Please confirm that you have scanned the correct MRB processing jobnum
ms: Sila sahkan bahawa anda telah mengimbas Nombor job pemprosesan MRB yang betul
zh_cn: 请确认你扫描了正确的MRB处理单号

# Txt_ScanQRCode
source: Please scan the QR code on the MRB jobnum
ms: Sila imbas kod QR pada MRB Nombor job
zh_cn: 请扫描MRB不合格单上二维码

# Txt_Add
source: Add
ms: Tambah
zh_cn: 新增

# Txt_AddAll
source: Add All
ms: Tambah Semua
zh_cn: 全部添加

# Txt_AddRevisionSucceeded
source: Successed to add revision
ms: Berjaya menambah revisi
zh_cn: 新增版本成功

# Txt_AddSingle
source: Add Single
ms: Tambah Satu
zh_cn: 单个添加

# Txt_AddSucceeded
source: Successed to Add
ms: Berjaya menambah
zh_cn: 新增成功

# Txt_All
source: All
ms: Pilih Semua
zh_cn: 全部

# Txt_AnotherLog
source: Use another service to log in.
ms: Sila guna perkhidmatan yang lain untuk log masuk
zh_cn: 使用其它服务登录.

# Txt_ApplicableModels
source: Applicable models
ms: Model yang berkenaan
zh_cn: 适用机型

# Txt_Approval
source: Approval
ms: Kelulusan
zh_cn: 审核处理

# Txt_Approval2
source: Approve
ms: Sahkan
zh_cn: 审核

# Txt_Approve
source: Approve
ms: Lulus
zh_cn: 通过

# Txt_Approved
source: Approved
ms: Lulus
zh_cn: 已审核

# Txt_ApprovingSendingEmail
source: Please wait while approving and sending email
ms: Sila tunggu sebentar semasa meluluskan dan menghantar emel
zh_cn: 正在审核并发送邮件，请稍候

# Txt_Ascending
source: Arrange this column in ascending order
ms: Susun lajur ini dalam tertib menail
zh_cn: 以升序排列此列

# Txt_AssemblyJobnumSelect
source: Please select the assembly jobnum to be printed
ms: Sila pilih Nombor job pemasangan untuk dicetak
zh_cn: 请选择需要打印的组装工单

# Txt_AssociateAccount
source: Associate your account.
ms: Kaitkan akaun anda
zh_cn: 关联您的帐户

# Txt_AssociateForm
source: Association Form
ms: Borang Persatuan
zh_cn: 关联界面

# Txt_AttentionItem
source: Attention Item
ms: Perkara dalam Perhatian
zh_cn: 注意事项

# Txt_AuthedRelogin1
source: You've successfully authenticated with
ms: Anda telah berjaya disahkan oleh
zh_cn: 您已成功通过身份验证

# Txt_AuthedRelogin2
source: Please enter a user name for this site below and click the Register button to finish logging in.
ms: Sila masukkan nama pengguna untuk tapak dibawah dan klik butang Daftar untuk meyelesaikan log masuk.
zh_cn: 请在下面输入此网站的用户名，然后单击“注册”按钮完成登录。

# Txt_BasicData
source: Basic Data
ms: Data Asas
zh_cn: 基础数据

# Txt_BasicInfor
source: Basic Infor
ms: Informasi Asas
zh_cn: 基础资料

# Txt_BatchQuantitySet
source: Lot quantity setting
ms: Tetapan kuantiti kumpulan
zh_cn: 批数量设置

# Txt_BE
source: BE
zh_cn: 后工

# Txt_CADFile
source: CAD File
ms: Fail CAD
zh_cn: CAD文件

# Txt_Cancel
source: Cancel
ms: Batal
zh_cn: 取消

# Txt_CannotSplitted
source: Can not be splitted
ms: Tidak boleh dibahagikan
zh_cn: 不能拆分

# Txt_Category
source: Category
ms: Kategori
zh_cn: 类别

# Txt_ChangeDescription
source: Description of Change
ms: Deskripsi Perubahan
zh_cn: 更改内容

# Txt_ChangeFrom
source: Change from
ms: Tukar dari
zh_cn: 变更前

# Txt_ChangeTo
source: Change to
ms: Tukar kepada
zh_cn: 变更后

# Txt_CheckEmailToResetPass
source: Please check your email to reset your password.
ms: Sila semak alamat emel anda untuk set semula kata laluan anda.
zh_cn: 请检查您的电子邮件以重置密码.

# Txt_Chinese
source: Chinese
ms: Bahasa Cina
zh_cn: 中文

# Txt_Classification
source: Classification
ms: Klasifikasi
zh_cn: 分类

# Txt_ClickToPaste
source: Click the text box to paste your image
ms: Klik kotak teks untuk menampal gambar anda
zh_cn: 点击文本框，粘贴图片

# Txt_ClickToStartProcessing
source: Click to start processing
ms: Klik untuk mula pemprosesan
zh_cn: 点击开始处理

# Txt_Close
source: Close
ms: Tutup
zh_cn: 关闭

# Txt_Compare
source: Compare
ms: Bandingkan
zh_cn: 对比

# Txt_Completed
source: Completed
ms: Selesai
zh_cn: 已完成

# Txt_ConClick1
source: Thank you for confirming your email. Please
ms: Terima kasih untuk pengesahan alamat emel anda. Sila
zh_cn: 感谢您确认您的电子邮件。请

# Txt_ConClick2
source: Click here to Log in
ms: klik disini untuk log masuk
zh_cn: 单击此处登录

# Txt_ConEmail
source: Confirm Email
ms: Sahkan alamat emel
zh_cn: 确认邮件

# Txt_Confirm
source: Confirm
ms: Sahkan
zh_cn: 确认

# Txt_Confirmed
source: Confirmed
ms: Disahkan
zh_cn: 已确认

# Txt_ContinuousScanningProcessing
source: Continuous scanning processing
ms: Pemprosesan imbasan berterusan
zh_cn: 持续扫描处理

# Txt_ControlFileRevisionRecordCurRev
source: Control File Revision Record -- Current Revision:
ms: Kawalan Rekod Semakan Fail -- Semakan Semasa:
zh_cn: 控制文件版本记录 -- 当前版本:

# Txt_ControlPlanNo
source: Control Plan Number
ms: Nombor Pelan Kawalan
zh_cn: 控制计划编号

# Txt_Copy
source: Copy
ms: Salinan
zh_cn: 复制

# Txt_CopyRevision
source: Copy Revision
ms: Salin Revisi
zh_cn: 版本复制

# Txt_CopyRevisonFailed
source: Failed to copy revison
ms: Gagal Menyalin Revisi
zh_cn: 版本复制失败

# Txt_CopyRevisonSucceeded
source: Successed to copy revison
ms: Berjaya Menyalin Revisi
zh_cn: 版本复制成功

# Txt_CoreTeam
source: Core Team
ms: Pasukan Utama
zh_cn: 核心组员

# Txt_Create
source: Create
ms: Cipta
zh_cn: 创建

# Txt_CreateAccount
source: Create a new account.
ms: Cipta akaun baru.
zh_cn: 创建新帐户.

# Txt_ModifyReworkJobnumConfirm
source: Are you sure to modify the rework jobnum
ms: Adakan anda pasti untuk mengubah suai Nombor job kerja semula
zh_cn: 确定修改返工工单

# Txt_CreateReworkJobnumSucceeded
source: Successed to create a rework jobnum
ms: Berjaya mencipta Nombor job kerja semula
zh_cn: 返工工单创建成功

# Txt_Criteria
source: Criteria
ms: Kriteria
zh_cn: 控制参数

# Txt_CriteriaDocumentCompare
source: Criteria and Document Comparision
ms: Perbandingan Kriteria dan Dokumen
zh_cn: 控制参数文件对比

# Txt_CurrentRevision
source: Current Revision
ms: Revisi Semasa
zh_cn: 当前版本

# Txt_CustomerDrawing
source: Customer Drawing
ms: Lukisan Pelanggan
zh_cn: 客户图纸

# Txt_CustomerDrawingRevision
source: Customer Drawing Revision
ms: Revisi Lukisan Pelanggan
zh_cn: 客户图纸版本

# Txt_CustomerEngineerApproval
source: Customer Engineering Approval/Date (If Req'd)
ms: Tarikh/Kelulusan Kejuruteraan Pelanggan (Jika Perlu)
zh_cn: 客户工程认可/日期(若要求)

# Txt_CustomerPartNum
source: Customer PartNumber
ms: Nombor Produk Pelanggan
zh_cn: 客户产品编号

# Txt_CustomerQMApproval
source: Customer Quality Approval/Date (If Req'd)
ms: Kelulusan Kualiti Pelanggan/Tarikh (Jika Perlu)
zh_cn: 客户品质认可/日期(若要求)

# Txt_DataEmpty
source: Data in the table is empty
ms: Data didalam jadual kosong
zh_cn: 表中数据为空

# Txt_Date
source: Date
ms: Tarikh
zh_cn: 日期

# Txt_DefaultOPRevision
source: Default OP Revision
ms: Revisi OP Tetap
zh_cn: 默认工序版本

# Txt_Definition
source: Definition
ms: Definisi
zh_cn: 定义

# Txt_Delete
source: Delete
ms: Padam
zh_cn: 删除

# Txt_DeleteConfirm1
source: Are you sure you want to delete [
ms: Adakah anda pasti mahu memadam [
zh_cn: 确定删除[

# Txt_DeleteFailed
source: Deletion failed
ms: Gagal untuk memadam
zh_cn: 删除失败

# Txt_DeleteRow
source: Delete Row
ms: Padam Baris
zh_cn: 删除行

# Txt_DeleteSucceeded
source: Deletion succeeded
ms: Berjaya dipadam
zh_cn: 删除成功

# Txt_Deleting
source: Deleting, please wait
ms: Sedang memadam, sila tunggu sebentar
zh_cn: 删除中，请稍候

# Txt_Desc
source: Desc
ms: Deskripsi
zh_cn: 说明

# Txt_Descending
source: Arrange this column in descending order
ms: Susun lajur ini dalam tertib menurun
zh_cn: 以降序排列此列

# Txt_Description
source: Description
ms: Deskripsi
zh_cn: 描述

# Txt_Detail
source: Detail
ms: Perincian
zh_cn: 明细

# Txt_DiscrepReason
source: Discrep Reason
ms: Sebab-sebab Percanggahan
zh_cn: 不良原因

# Txt_DisplayAreaResults
source: Display results _START_ to _END_ of _TOTAL_
ms: Paparkan hasil _START_ hingga _END_ daripada _TOTAL_
zh_cn: 显示第_START_至_END_项结果，共_TOTAL_项

# Txt_DisplayAreaResults2
source: Display results 0 to 0 of 0
ms: Paparkan hasil 0 hingga 0 daripada 0
zh_cn: 显示第 0 至 0 项结果，共 0 项

# Txt_DisplayResults
source: Display _MENU_ results
ms: Paparkan keputusan _MENU_
zh_cn: 显示 _MENU_ 项结果

# Txt_Drawing
source: Drawing
ms: Lukisan
zh_cn: 图纸

# Txt_ECNApproverNoEmpty
source: Related Dept. Approver of ECN cannot be empty
ms: Jabatan Berkaitan Pelulus ECN tidak boleh kosong
zh_cn: ECN相关部门审核人员不能为空

# Txt_ECNNo
source: ECN No.
zh_cn: ECN编号

# Txt_ECRNo
source: ECR No.
zh_cn: ECR编号

# Txt_Edit
source: Edit
ms: Sunting
zh_cn: 编辑

# Txt_Editing
source: Editing, please wait
ms: Sedang disunting, sila tunggu sebentar
zh_cn: 编辑中，请稍候

# Txt_EditTestInstrument
source: TestInstrument Edit
ms: Sunting Instrumen Ujian
zh_cn: 检测仪器编辑

# Txt_EffectiveDate
source: Effective Date
ms: Tarikh Kuat Kuasa
zh_cn: 生效日期

# Txt_EmailLink
source: Email Link
ms: Pautan alamat emel
zh_cn: 邮箱链接

# Txt_EngineerChangeNotification
source: Engineering Change Notification
ms: Pemberitahuan Perubahan Kejuruteraan
zh_cn: 工程变更通知

# Txt_EngineeringTest
source: Engineering test
ms: Ujian Kejuruteraan
zh_cn: 工程试验

# Txt_EngineerProcessing
source: Engineer processing
ms: Pemprosesan kejuruteraan
zh_cn: 工程处理中

# Txt_English
source: English
ms: Bahasa Inggeris
zh_cn: 英文

# Txt_EnterCode
source: Enter verification code
ms: Masukkan kod verifikasi
zh_cn: 输入验证码

# Txt_EnterEmail
source: Enter your email.
ms: Masukkan alamat emel anda.
zh_cn: 输入您的邮箱.

# Txt_EnterValidBatchQuantity
source: You must enter a valid lot quantity
ms: Anda mesti memasukkan kuantiti kumpulan yang sah
zh_cn: 必须输入有效的批数量

# Txt_EpicorJobList
source: Epicor Job List
ms: Senarai Job Epicor
zh_cn: Epicor 工单列表

# Txt_EWIApprove
source: EWI Approval
ms: Kelulusan EWI
zh_cn: EWI审核

# Txt_EWIControlDocRevisionRecord
source: EWI Control Doc Revision Record
ms: Rekod Semakan Dokumen Kawalan EWI
zh_cn: EWI控制文件版本记录

# Txt_EWIRevisionDetail
source: EWI Revision Detail
ms: Butiran Semakan EWI
zh_cn: EWI版本明细

# Txt_Export
source: Export
ms: Eksport
zh_cn: 导出

# Txt_ExportReturn
source: Export PDF and Return
ms: Eksport PDF dan Kembali
zh_cn: 导出PDF并返回

# Txt_FE
source: FE
zh_cn: 前工

# Txt_Figure
source: Figure
ms: Rajah
zh_cn: 图位

# Txt_File
source: File
ms: Fail
zh_cn: 文件

# Txt_FilterResults
source: By _MAX_ Item result filtering
ms: Oleh _MAX_ Penapisan hasil item
zh_cn: 由_MAX_项结果过滤

# Txt_First
source: First
ms: Pertama
zh_cn: 首页

# Txt_FixtureLink
source: Fixture Link
ms: Pautan Fixture
zh_cn: 夹具链接

# Txt_FixtureNo
source: Fixture No
ms: Nombor Fixture
zh_cn: 夹具编号

# Txt_ForgetPassword
source: Forgot your password?
ms: Lupa kata laluan anda?
zh_cn: 忘记您的密码了?

# Txt_ForgotPassConfirm
source: Forgot Password Confirmation
ms: Pengesahan lupa kata laluan
zh_cn: 忘记密码确认

# Txt_Handled
source: Handled
ms: Ditangani
zh_cn: 已处理

# Txt_ID
source: ID
zh_cn: 内码

# Txt_ImproveECN
source: Please improve ECN information
ms: Sila tambah baik maklumat ECN
zh_cn: 请完善ECN信息

# Txt_Initiator
source: Initiator
ms: Pemula
zh_cn: 起稿人

# Txt_Initiator2
source: Initiator
ms: Pemulaan
zh_cn: 起草

# Txt_InsertRowAbove
source: Insert Row Above
ms: Tambah Baris di Atas
zh_cn: 上面插入行

# Txt_InsertRowBelow
source: Insert Row Below
ms: Tambah Baris di Bawah
zh_cn: 下面插入行

# Txt_Invalid
source: Invalid
ms: Tidak sah
zh_cn: 失效

# Txt_InvalidateVersionConfirm
source: Are you sure to invalidate current version?
ms: Adakah anda pasti hendak membatalkan versi semasa?
zh_cn: 确定使当前版本失效吗？

# Txt_InvalidSucceeded
source: Successed to invalid
ms: Tidak sahkan Berjaya
zh_cn: 失效成功

# Txt_JobNum
source: JobNum
ms: Nombor job
zh_cn: 工单

# Txt_JobnumQuantity
source: Job Quantity
ms: Kuantiti Nombor job
zh_cn: 工单数量

# Txt_JobnumSplitCompleted
source: Jobnum splitting completed
ms: Pembahagian Nombor job selesai
zh_cn: 工单拆分已完成

# Txt_KeyContactPhone
source: Key Contact/Phone
ms: Kenalan Utama/Telefon
zh_cn: 主要联系人/电话

# Txt_KeywordSearch
source: Keyword Search
ms: Carian Katakunci
zh_cn: 关键字搜索

# Txt_Last
source: Last
ms: Terakhir
zh_cn: 末页

# Txt_LatestChange
source: Latest Change Level
ms: Tahan Perubahan Terkini
zh_cn: 最新更改级别

# Txt_LatestDateRev
source: Latest Date / Latest Rev.
ms: Tarikh Terkini / Revisi Terkini
zh_cn: 最新日期/最新版本

# Txt_Loading
source: Loading
ms: Sedang dimuatkan
zh_cn: 载入中

# Txt_LogAccount
source: Log in using your account
ms: Log masuk dengan menggunakan akaun anda
zh_cn: 使用您的帐户登录

# Txt_Login
source: Log in
ms: Log masuk
zh_cn: 登录

# Txt_LoginErrors
source: Username or IP login errors more than 5 times
ms: Nama pengguna atau log masuk IP ralat lebih daripada 5 kali
zh_cn: 用户名或IP登录错误次数超过5次

# Txt_LoginFailure
source: Login Failure
ms: Log masuk gagal
zh_cn: 登录失败

# Txt_LoginFailureMsg
source: Unsuccessful login with service.
ms: log masuk tidak berjaya dengan menggunakan perkhidmatan.
zh_cn: 服务登录不成功。

# Txt_LoginUseLocalAccount
source: Use a local account to log in.
ms: Gunakan akaun tempatan untuk log masuk.
zh_cn: 使用本地帐户登录。

# Txt_LotTraveller
source: Lot Traveller
zh_cn: 流程纸

# Txt_LotTravellerSelect
source: Please select the lot traveller to be printed
ms: Sila pilih lot traveller yang ingin dicetak
zh_cn: 请选择需要打印的流程纸

# Txt_Machine
source: Machine
ms: Mesin
zh_cn: 机型

# Txt_Mark
source: Mark
ms: Tanda
zh_cn: 标记

# Txt_Material
source: Part Number
ms: Bahan
zh_cn: 物料

# Txt_Modified
source: Modified
ms: Telah diubah suai
zh_cn: 已修改

# Txt_ModifyBatchQuantityConfirm
source: Are you sure to modify the lot quantity?
ms: Adakah anda pasti untuk mengubah suai kuantiti kumpulan？
zh_cn: 确定修改批数量?

# Txt_ModifyBatchQuantitySucceeded
source: Successed to modify the lot quantity
ms: Berjaya mengubah suai kuantiti kumpulan
zh_cn: 批数量修改已成功

# Txt_ModifyECNSucceeded
source: Successed to modify ECN
ms: Berjaya mengubah suai ECN
zh_cn: 修改ECN成功

# Txt_ModifyFailed
source: Failed to modify
ms: Gagal untuk mengubah suai
zh_cn: 修改失败

# Txt_ModifyOPConfirm
source: Are you sure you want to modify the OP？
ms: Adakah anda pasti mahu mengubah suai OP?
zh_cn: 确定修改工序？

# Txt_ModifyOrderFailed
source: Failed to modify the order
ms: Gagal mengubah suai pesanan
zh_cn: 顺序修改失败

# Txt_ModifyRevisionSucceeded
source: Successed to modify revision
ms: Berjaya mengubah suai revisi
zh_cn: 修改版本成功

# Txt_ModifyReworkJobnumFailed
source: Failed to modify rework jobnum
ms: Gagal mengubah suai Nombor job kerja semula
zh_cn: 返工工单修改失败

# Txt_ModifyReworkJobnumSucceeded
source: Succeeded to modify rework jobnum
ms: Berjaya mengubah suai Nombor job kerja semula
zh_cn: 返工工单修改成功

# Txt_ModifySucceeded
source: Succeeded to modify
ms: Berjaya diubah suai
zh_cn: 修改成功

# Txt_MoveDown
source: Move Down
ms: Gerak ke Bawah
zh_cn: 下移

# Txt_MoveFirst
source: Move First
ms: Alih Pertama
zh_cn: 首个

# Txt_MoveLast
source: Move Last
ms: Gerak ke Terakhir
zh_cn: 最后

# Txt_MoveUp
source: Move Up
ms: Gerak ke Atas
zh_cn: 上移

# Txt_MRBJobnumErrorOccurred
source: An error occurred and the MRB jobnum could not be processed
ms: Ralat telah berlaku dan Nombor job MRB tidak dapat diproses
zh_cn: 出现错误，无法处理该MRB

# Txt_MRBJobnumNotFound
source: The MRB jobnum can not be found
ms: Nombor job MRB tidak ditemui
zh_cn: 找不到该MRB不合格品处理单

# Txt_MRBJobnumNotReceived
source: The MRB jobnum has not been received by MRB
ms: Nombor job MRB tidak diterima oleh MRB
zh_cn: 该MRB不合格处理单还未被MRB接收

# Txt_MRBJobnumProcessed
source: The MRB jobnum has been processed
ms: Nombor job MRB telah diproses
zh_cn: 该MRB不合格处理单已被处理

# Txt_MRBJobSelect
source: Please select the MRB job list to be printed
ms: Sila pilih senarai job MRB untuk dicetak
zh_cn: 请选择需要打印的不合格品单

# Txt_MRBNo
source: MRB No.
zh_cn: MRB号

# Txt_MRBProcessing
source: MRB Processing
ms: Pemprosesan MRB
zh_cn: MRB处理

# Txt_MRBQuantity
source: MRB Quantity
ms: Kuantiti MRB
zh_cn: 不合格数量

# Txt_MRBReason
source: MRB Reason
ms: Sebab-sebab MRB
zh_cn: 不合格原因

# Txt_MRBReasonConfirm
source: MRB Reason Determine
ms: Tentukan Sebab-sebab MRB
zh_cn: 不合格原因确定

# Txt_Next
source: Next
ms: Seterusnya
zh_cn: 下页

# Txt_NoAnyRevision
source: There is not any version, please add a new version
ms: Tiada sebarang versi, sila tambah versi baharu
zh_cn: 当前没有任何版本，请新增版本

# Txt_NoDetailsPartnum
source: No details found for the Part number
ms: Tiada maklumat ditemui untuk nombor produk tersebut
zh_cn: 找不到该编号的详细信息

# Txt_NoEngineerChangeNotification
source: There is not engineering change notification
ms: Tiada pemberitahuan perubahan kejuruteraan
zh_cn: 当前没有工程变更通知

# Txt_NoExternalAuth
source: There are no external authentication services configured. See <a href=“http://go.microsoft.com/fwlink/?LinkId=403804“>this article</a> for details on setting up this ASP.NET application to support logging in via external services.
ms: Tiada pengesahan perkhidmatan luar dikonfigurasikan. Lihat <a href=“http://go.microsoft.com/fwlink/?LinkId=403804“>artikel</a> ini untuk mendapatkan butiran tentang menyediakan aplikasi ASP.NET ini untuk menyokong log masuk melalui perkhidmatan luar
zh_cn: 未配置外部身份验证服务。参见<a href=“http://go.microsoft.com/fwlink/?LinkId=403804“>本文</a> 有关设置此ASP.NET应用程序以支持通过外部服务登录的详细信息。

# Txt_NoMatchedResults
source: No matching results
ms: Tiada hasil yang sepadan
zh_cn: 没有匹配的结果

# Txt_None
source: None
ms: Tiada
zh_cn: 无

# Txt_NoRollbackConfirmed
source: It cannot be rollback after confirmation
ms: Ia tidak boleh ditarik balik selepas pengesahan
zh_cn: 确认后将无法撤回

# Txt_NoRollbackSplitted
source: It cannot be rollback after splitted
ms: Ia tidak boleh ditarik balik selepas dibahagikan
zh_cn: 拆分后将无法撤回

# Txt_NotPrinted
source: Not printed
ms: Tidak dicetak
zh_cn: 未打印

# Txt_OP
source: OP
zh_cn: 工序

# Txt_OPCode
source: OP Code
ms: Kod OP
zh_cn: 工序代码

# Txt_OPDescription
source: OP Description
ms: Deksripsi OP
zh_cn: 工序描述

# Txt_Operation
source: Actions
ms: Operasi
zh_cn: 操作

# Txt_OperationFailed
source: Operation failed
ms: Operasi gagal
zh_cn: 操作失败

# Txt_OperationSucceeded
source: Operation succeeded
ms: Operasi telah berjaya
zh_cn: 操作成功

# Txt_OPFile
source: OP File
ms: Fail OP
zh_cn: 工序文件

# Txt_OPManage
source: OP Management
ms: Pengurusan OP
zh_cn: 工序管理

# Txt_OPSelection
source: OP Selection
ms: Pilihan OP
zh_cn: 工序选择

# Txt_OPTime
source: OP Time
ms: Masa OP
zh_cn: 工序时间

# Txt_OrigDate
source: Date (Orig.)
ms: Tarikh (Asal)
zh_cn: 日期(初始)

# Txt_OtherApproval
source: Other Approval/Date (If Req'd)
ms: Kelulusan Lain/Tarikh (Jika Perlu)
zh_cn: 其他认可/日期(若要求)

# Txt_OutRecordConfirm
source: Confirm the selected outsource record?
ms: Sahkan rekod keluar yang dipilih
zh_cn: 是否确认所选的外发记录

# Txt_OutRecordConfirmSucceeded
source: Succeeded to confirm the out records
ms: Berjaya mengesahkan rekod keluar
zh_cn: 外发记录确认已成功

# Txt_OutSource
source: OutSource
ms: Sumber Luar
zh_cn: 外发

# Txt_ParentJobnum
source: Parent Jobnum
ms: Nombor job induk
zh_cn: 上级工单

# Txt_Part
source: Part
ms: Produk
zh_cn: 产品

# Txt_PartDescription
source: Part Description
ms: Deskripsi Produk
zh_cn: 产品描述

# Txt_PartNumber
source: PartNumber
ms: Nombor Produk
zh_cn: 产品编号

# Txt_PartnumEmpty
source: Part number is empty, or the length is more than 50
ms: Nombor produk pelanggan kosong, atau panjangnya lebih daripada 50
zh_cn: 编号为空，或长度超过50

# Txt_PartNumLatestChange
source: Part Number/Latest Change Level
ms: Nombor Produk/Tahap Perubahan Terkini
zh_cn: 产品编号/最新更改级别

# Txt_PasteFailed
source: Failed to paste picture
ms: Gagal tampal gambar
zh_cn: 粘贴图片失败

# Txt_PasteSucceeded
source: Succeeded to paste picture
ms: Berjaya tampal gambar
zh_cn: 粘贴图片成功

# Txt_Pasting
source: Pasting data, wait for a moment please
ms: Menampal data, sila tunggu sebentar
zh_cn: 正在粘贴数据，请稍候

# Txt_PCNECNNo
source: P.C.N. & E.C.N. NO.
zh_cn: 工序&工程更改编号

# Txt_Prelaunch
source: Pre-launch
ms: Prapelancaran
zh_cn: 试生产

# Txt_Previous
source: Previous
ms: Sebelum
zh_cn: 上页

# Txt_Print
source: Print
ms: Cetak
zh_cn: 打印

# Txt_Printed
source: Printed
ms: Telah dicetak
zh_cn: 已打印

# Txt_Printer
source: Printer
ms: Mesin pencetak
zh_cn: 打印人

# Txt_PrintLotTraveller
source: Print Lot Traveller
ms: Cetak Lot Traveller
zh_cn: 打印流程纸

# Txt_PrintReworkLotTraveller
source: Print rework lot traveller
ms: Cetak Kerja Semula Lot Traveller
zh_cn: 打印返工流程纸

# Txt_PrintTime
source: Print Time
ms: Masa Dicetak
zh_cn: 打印时间

# Txt_PrintTimes
source: Print Times
ms: Cetakan Kali Ke
zh_cn: 打印次数

# Txt_Processing
source: Processing
ms: Sedang diproses
zh_cn: 处理中

# Txt_ProcessingSucceeded
source: Processing succeeded
ms: Pemprosesan berjaya
zh_cn: 处理成功

# Txt_Production
source: Production
ms: Pengeluaran
zh_cn: 正式投产

# Txt_Prototype
source: Prototype
ms: Prototaip
zh_cn: 样件

# Txt_QMToBeSubmitted
source: QM to be submitted
ms: Untuk Dihantar kepada QM
zh_cn: 待提交品质

# Txt_Quantity
source: Quantity
ms: Kuantiti
zh_cn: 数量

# Txt_QuantityStarted
source: Quantity Started
ms: Kuantiti yang telah Dimulakan
zh_cn: 开工数量

# Txt_Query
source: Query
ms: Pertanyaan
zh_cn: 查询

# Txt_RapidMRB
source: Rapid scanning and processing MRB
ms: Pengimbasan pantas dan pemprosesan MRB
zh_cn: 快速扫描处理MRB

# Txt_Reason
source: Reason
ms: Sebab
zh_cn: 原因

# Txt_Reasons
source: Change Reasons
ms: Sebab-Sebab Penukaran
zh_cn: 变更原因

# Txt_Refresh
source: Refresh
ms: Segar Semula
zh_cn: 刷新

# Txt_RegenerateEWI
source: Regenerate EWI
ms: Jana Semula EWI
zh_cn: 重新生成EWI

# Txt_RegenerateEWIFailed
source: Failed to generate EWI file
ms: Gagal menjana fail EWI
zh_cn: 生成EWI文件失败

# Txt_RegenerateEWISucceeded
source: EWI file is regenerated successfully
ms: Fail EWI berjaya dijana semula
zh_cn: 重新生成EWI文件成功

# Txt_RegeneratingEWI
source: Please wait while the EWI file is regenerated
ms: Sila tunggu sementara fail EWI dijana semula
zh_cn: 正在重新生成EWI文件，请稍候

# Txt_Register
source: Register
ms: Daftar
zh_cn: 注册

# Txt_RegisterNewUser
source: Register as a new user
ms: Daftar sebagai pengguna baru
zh_cn: 新用户注册

# Txt_Reject
source: Reject
ms: Tolak
zh_cn: 拒绝

# Txt_Rejected
source: Rejected
ms: Ditolak
zh_cn: 已拒绝
