Repository: CompartIT/MES-WebAdmin-Alpha
Catalog: WebAdmin/APP_GlobalResources/Resource.*.resx
Languages: ms, zh_cn

# Txt_OutsourceReceiptSelect
source: Please select the outsource receipt to be printed
ms: Sila pilih Penerimaan Sumber Luar untuk dicetak
zh_cn: 请选择需要打印的外包收货单

# Txt_QMSubmitEWI
source: QM has submitted a EWI revision
ms: QM telah menghantar revisi EWI
zh_cn: 品质已提交EWI版本

# Txt_RejectEWI
source: has rejected a EWI revision
ms: telah menolak satu revisi
zh_cn: 拒绝了EWI版本

# Txt_SubmitEWI
source: has submitted a EWI revision
ms: telah menghantar revisi EWI
zh_cn: 提交了EWI版本

# Txt_SynchronizeConfirm2
source: Are you sure you want to synchronize data from Epicor?
ms: Anda pasti ingin menyegerakkan data dari Epicor?
zh_cn: 确定从Epicor同步数据吗？

# SQL_DefaultOPIncorrect
source: Incorrect default job process version
ms: Versi proses job tetap yang tidak betul
zh_cn: 默认工序版本的格式不正确

# Txt_OPSeq
source: OP Seq
ms: Turutan OP
zh_cn: 工序

# Txt_BeSubmittedForQM
source: To be submitted for QM
ms: Untuk dihantar ke QM
zh_cn: 品质待提交

# Txt_QualifiedQuantityNotEmpty
source: Qualified quantity cannot be empty
ms: Kuantiti yang Layak tidak boleh kosong
zh_cn: 合格数量不能为空

# Txt_SessionExpired
source: Session has expired, please login again
ms: Sesi tamat tempoh, sila log masuk semula
zh_cn: Session已过期，请重新登录

# SQL_NoPartOP
source: Part OP is not synchronized, please contact IT to resynchronize!
ms: Proses produk tidak disegerakkan, sila hubungi IT untuk disegerakkan semula!
zh_cn: 未同步产品工序，请联系IT重新同步！

# Txt_ChangePassword
source: Change Password
ms: 密码修改
zh_cn: 密码修改

# Txt_ErrPwdRegular
source: The password must contains at least 1 uppercase letter, 1 lowercase letter and 1 number, and the length shall be 8 digits
ms: 密码至少包含1个大写字母、1个小写字母、1个数字，且长度为8位
zh_cn: 密码至少包含1个大写字母、1个小写字母、1个数字，且长度为8位

# Txt_ErrPwdRegularEasy
source: The password is alphabetic, numeric or character with a length of at least 6 digits
ms: 密码为字母、数字、字符，且长度为8至16位
zh_cn: 密码为字母、数字、字符，且长度至少6位

# Txt_ErrUserPwd
source: Username or password is incorrect
ms: 用户名或密码不正确
zh_cn: 用户名或密码不正确

# Txt_IsInitialPwd
source: It is the initial password, change the it please
ms: 当前为初始密码，请修改密码
zh_cn: 当前为初始密码，请修改密码

# Txt_NewPassword
source: New Password
ms: 新密码
zh_cn: 新密码

# Txt_NewPasswordConfirm
source: Confirm Password
ms: 确认密码
zh_cn: 确认密码

# Txt_OldPassword
source: Old Password
ms: 当前密码
zh_cn: 旧密码

# Txt_PasswordNotMatch
source: New password is different from Confirm Password
ms: 新密码和确认密码不一致
zh_cn: 新密码和确认密码不一致

# Txt_OutsourceShipment
source: Outsource Shipment
zh_cn: 外包发货

# Txt_ErrPwd
source: Old Password is incorrect
zh_cn: 旧密码不正确

# Txt_Splitter
source: Splitter
zh_cn: 拆分人

# Txt_SplitTime
source: Split Time
zh_cn: 拆分时间

# Menu_MyEWI
source: My EWI
ms: EWI Saya

# Menu_QMSBasic
source: QMS
ms: QMS Asas

# Txt_CompartMES
source: Compart MES
ms: MES Compart

# Txt_ContractIT
source: Please contract IT
ms: Sila hubungi IT
